Revit 2024 API
MEPNetworkSegmentData.GetDownstreamSegments Method
 Gets all downstream network segments.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public IList<MEPNetworkSegmentId> GetDownstreamSegments()
Visual Basic
Public Function GetDownstreamSegments As IList(Of MEPNetworkSegmentId)
Visual C++
public:
IList<MEPNetworkSegmentId^>^ GetDownstreamSegments()
Return Value
 The list of segments that flow out of this segment.
See Also
MEPNetworkSegmentData Class
Autodesk.Revit.DB.Analysis Namespace